# Используем официальный образ Node.js. Вы можете выбрать версию, которую считаете нужной, 
# например, вместо 'latest' написать '14'.
FROM node:latest 

# Указываем рабочую директорию в контейнере
WORKDIR /usr/src/app

# Копируем файл package.json и package-lock.json (если есть)
COPY package*.json ./

# Устанавливаем все зависимости
RUN npm ci

# Если вы хотите установить npm пакеты глобально, можно использовать строку ниже
# RUN npm install -g <your-package>

# Копируем исходные файлы приложения в контейнер
COPY . .

ENV PORT=3000

# Экспонируем порт на который будет привязано приложение
# Если ваше приложение работает на другом порте, его следует указать здесь
EXPOSE $PORT

# Запускаем приложение
CMD [ "npm", "start" ]
